src/Documents/ПриходноКассовыйОрдер/ПриходноКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
	<name>ПриходноКассовыйОрдер</name>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСКассирами</registerRecords>
	<registerRecords>AccumulationRegister.ДвижениеДенежныхСредств</registerRecords>
	<attributes>
		<name>Касса</name>
		<type>
			<types>CatalogRef.Касса</types>
		</type>
	</attributes>
	<attributes>
		<name>Покупатель</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</attributes>
	<attributes>
		<name>СуммаПлатежа</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>БанковскийСчет</name>
		<type>
			<types>CatalogRef.БанковскийСчет</types>
		</type>
	</attributes>
	<attributes>
		<name>ВидОплаты</name>
		<type>
			<types>EnumRef.ВидОплаты</types>
		</type>
	</attributes>
	<attributes>
		<name>ВалютаОплаты</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</attributes>
	<tabularSections>
		<name>РасшифровкаПлатежа</name>
		<attributes>
			<name>Билет</name>
			<type>
				<types>CatalogRef.Билет</types>
			</type>
		</attributes>
		<attributes>
			<name>СуммаПлатежа</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СуммаВзаиморасчетов</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ВалютаВзаиморасчетов</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
		<attributes>
			<name>МаскаБилета</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>15</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Поставщик</name>
			<type>
				<types>CatalogRef.Агенство</types>
			</type>
		</attributes>
	</tabularSections>
	<tabularSections>
		<name>Расшифровка</name>
		<attributes>
			<name>СуммаЗадолженности</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ВалютаВзаиморасчетов</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
		<attributes>
			<name>ЗачетОплаты</name>
			<type>
				<types>Boolean</types>
			</type>
		</attributes>
	</tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ВзаиморасчетыСКассирами/ВзаиморасчетыСКассирами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ВзаиморасчетыСКассирами</name>
	<resources>
		<name>СуммаЗадолженности</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<dimensions>
		<name>Билет</name>
		<type>
			<types>CatalogRef.Билет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ВалютаВзаиморасчетов</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Субагент</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Организация</name>
		<type>
			<types>CatalogRef.Организация</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ДвижениеДенежныхСредств/ДвижениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ДвижениеДенежныхСредств</name>
	<resources>
		<name>Сумма</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<dimensions>
		<name>БанковскийСчетКасса</name>
		<type>
			<types>CatalogRef.Касса</types>
			<types>CatalogRef.БанковскийСчет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Покупатель</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Поставщик</name>
		<type>
			<types>CatalogRef.Агенство</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Валюта</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ХозяйственнаяОперация</name>
		<type>
			<types>EnumRef.ХозОперации</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/Enums/ХозОперации/ХозОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>ХозОперации</name>
	<enumValues>
		<name>ОплатаПоставщику</name>
	</enumValues>
	<enumValues>
		<name>ПрочийРасход</name>
	</enumValues>
	<enumValues>
		<name>ПоступлениеОтКлиента</name>
	</enumValues>
	<enumValues>
		<name>ВозвратПокупателю</name>
	</enumValues>
	<enumValues>
		<name>Штраф</name>
	</enumValues>
	<enumValues>
		<name>ПродажаБилета</name>
	</enumValues>
	<enumValues>
		<name>Конвертация</name>
	</enumValues>
</mdclass:Enum>

src/Documents/ПриходноКассовыйОрдер/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	#Область ВзаиморасчетыСКассирами
	Движения.ВзаиморасчетыСКассирами.Записывать=Истина;
	//-------- Метод распределения суммы по ФИФО
	ТаблицаВзаиморасчетов=МодульПроведенияНаСервере.ВозвратДетализацииПоКассирам(Покупатель,Дата,"ПроведениеДокумента");
	СуммаПлатежаЗначение=СуммаПлатежа;
	Остаток=0;
	Для каждого СтрТаб из ТаблицаВзаиморасчетов Цикл
		Если СуммаПлатежаЗначение>0 Тогда	
			Движение=Движения.ВзаиморасчетыСКассирами.Добавить();
			Остаток=СуммаПлатежаЗначение-СтрТаб.СуммаЗадолженности;
			Если Остаток>0 Тогда
			Движение.СуммаЗадолженности=СуммаПлатежаЗначение-Остаток;
		Иначе
			Движение.СуммаЗадолженности=СуммаПлатежаЗначение;
			КонецЕсли;
			СуммаПлатежаЗначение=СуммаПлатежаЗначение-СтрТаб.СуммаЗадолженности;
			Движение.Билет=СтрТаб.Билет;
			Движение.ВалютаВзаиморасчетов=ВалютаОплаты;
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Движение.Организация=Справочники.Организация.ОсновнаяОрганизация;
			Движение.Период=Дата;
			Движение.Субагент=Покупатель;
			КонецЕсли;
	КонецЦикла;
	//--------
	#КонецОбласти
	#Область ДДС
	Движения.ДвижениеДенежныхСредств.Записывать=Истина;
	ДС=Движения.ДвижениеДенежныхСредств.Добавить();
	ДС.ВидДвижения=ВидДвиженияНакопления.Приход;
	Если Касса<>Неопределено Тогда
		ДС.БанковскийСчетКасса=Касса;
	Иначе
		ДС.БанковскийСчетКасса=БанковскийСчет;
	КонецЕсли;
	ДС.Покупатель=Покупатель;
	ДС.Период=Дата;
	ДС.Сумма=СуммаПлатежа;
	ДС.Валюта=ВалютаОплаты;
	ДС.ХозяйственнаяОперация=Перечисления.ХозОперации.ПоступлениеОтКлиента;
	#КонецОбласти
КонецПроцедуры
